_org/busy-beaver-derived.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:nil todo:t |:t
#+title: A Busy Beaver Champion Program Derived from Scratch
#+date: <2021-10-31 Sun>
#+author: Nick Drozd
#+email: nicholasdrozd@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.0.50 (Org mode 9.5)
#+cite_export:
#+jekyll_layout: post
#+jekyll_categories:
#+jekyll_tags:

The *classic Busy Beaver game* asks how long an /n/-state /k/-color Turing machine program can run before *executing a halt instruction*. The phrase "executing a halt instruction" is not normally used in stating the problem; instead, people just say "halting". But executing a halt instruction is just one way for a program to signal that it is finished. From the point of view of a programmer trying to maximize machine steps, it's about *the worst termination signal possible* because it requires wasting valuable program space on the halt instruction. If *[[https://nickdrozd.github.io/2021/01/14/halt-quasihalt-recur.html][other termination conditions]]* are allowed, programs can run for much, much longer.

[[https://nickdrozd.github.io/2021/07/11/self-cleaning-turing-machine.html][I recently discovered one such program.]] With just four states and two colors, it undertakes a computation for *32,779,478 steps* before signalling termination. (Don't worry, we'll get to how exactly this "termination" is "signalled".) Among programs with an explicit halt instruction the record is 107 steps, so this new champion is a shocking improvement. *A slightly more liberal understanding of program behavior vastly increases expressive power.*

You might think that such a program would be complicated and difficult to understand. This, at least, is what the *[[https://nickdrozd.github.io/2021/01/26/spaghetti-code-conjecture.html][Spaghetti Code Conjecture]]* predicts. In fact, [[https://nickdrozd.github.io/2021/09/25/spaghetti-code-conjecture-false.html][the Spaghetti Code Conjecture might be false]], and *the program is remarkably elegant*. It's so straightforward that it can be *derived from scratch*.

#+TOC: headlines 2

* Number Theory

First, a little *number theory*. Consider the following function:

#+begin_src
L : ℕ -> ℕ
L (3k)     = 0
L (3k + r) = L (5k + r + 3)
#+end_src

Here's a description in plain language. /L/ checks if its input is divisible by 3. If it is, the output is 0; otherwise, some transformation is applied to the input and /L/ is called again, recursively, on the result. *Is /L/ total?* That is, does it return an answer for all inputs? That's an *open question*.

Here's another function with a similar flavor:

#+begin_src
C : ℕ -> ℕ
C 0        = 0
C 1        = 1
C (2k)     = C k
C (2k + 1) = C (3k + 2)
#+end_src

Is /C/ total? The *Collatz Conjecture* says that it is, but that too is an open question. But forget about /C/. We're interested in /L/.

It usually takes no more than a few iterations to caluclate /L(n)/, but occasionally it takes longer. In particular, it is strange but true that */L(2)/ requires fourteen iterations to calculate*. Keep this fact in mind for later.

