_posts/2021-10-31-busy-beaver-derived.md
---
title: "A Busy Beaver Champion Program Derived from Scratch"
date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-10-31 Sun&gt;</span></span>
layout: post
categories:
tags:
---
The **classic Busy Beaver game** asks how long an *n*-state *k*-color Turing machine program can run before **executing a halt instruction**. The phrase "executing a halt instruction" is not normally used in stating the problem; instead, people just say "halting". But executing a halt instruction is just one way for a program to signal that it is finished. From the point of view of a programmer trying to maximize machine steps, it's about **the worst termination signal possible** because it requires wasting valuable program space on the halt instruction. If **[other termination conditions](https://nickdrozd.github.io/2021/01/14/halt-quasihalt-recur.html)** are allowed, programs can run for much, much longer.

[I recently discovered one such program.](https://nickdrozd.github.io/2021/07/11/self-cleaning-turing-machine.html) With just four states and two colors, it undertakes a computation for **32,779,478 steps** before signalling termination. (Don't worry, we'll get to how exactly this "termination" is "signalled".) Among programs with an explicit halt instruction the record is 107 steps, so this new champion is a shocking improvement. **A slightly more liberal understanding of program behavior vastly increases expressive power.**

You might think that such a program would be complicated and difficult to understand. This, at least, is what the **[Spaghetti Code Conjecture](https://nickdrozd.github.io/2021/01/26/spaghetti-code-conjecture.html)** predicts. In fact, [the Spaghetti Code Conjecture might be false](https://nickdrozd.github.io/2021/09/25/spaghetti-code-conjecture-false.html), and **the program is remarkably elegant**. It's so straightforward that it can be **derived from scratch**.


# Table of Contents

1.  [Number Theory](#org83935fc)
2.  [C implementation of *L*](#orgff4cd9e)
3.  [Getting the input onto the tape](#org6b733fa)
4.  [From C to Turing Machine](#org3caefc6)
5.  [Structured Programming](#orge8ed5cd)
6.  [Who wrote this program?](#org8af05bf)
7.  [Turing machine programming exercise](#org79c139f)


<a id="org83935fc"></a>

# Number Theory

First, a little **number theory**. Consider the following function:

{% highlight nil %}
L : ℕ -> ℕ
L (3k)     = 0
L (3k + r) = L (5k + r + 3)
{% endhighlight %}

Here's a description in plain language. *L* checks if its input is divisible by 3. If it is, the output is 0; otherwise, some transformation is applied to the input and *L* is called again, recursively, on the result. **Is *L* total?** That is, does it return an answer for all inputs? That's an **open question**.

Here's another function with a similar flavor:

{% highlight nil %}
C : ℕ -> ℕ
C 0        = 0
C 1        = 1
C (2k)     = C k
C (2k + 1) = C (3k + 2)
{% endhighlight %}

Is *C* total? The **Collatz Conjecture** says that it is, but that too is an open question. But forget about *C*. We're interested in *L*.

It usually takes no more than a few iterations to caluclate *L(n)*, but occasionally it takes longer. In particular, it is strange but true that ***L(2)* requires fourteen iterations to calculate**. Keep this fact in mind for later.
