_org/busy-beaver-derived.org
* Getting the input onto the tape

So, we have a program that will calculate /L(n)/ given an initial input of /n/, and we know that /L(2)/ runs for a long time. But the rules of the Busy Beaver game say that the tape must start off blank. *How does the initial input get onto the tape?*

This is a question in the field of Turing machines that is *terribly under-discussed*. Great efforts are made to find the "simplest possible machine" to do this or that, but the measure of "simplicity" never seems to include the tape inputs. How much computation is required to get the input onto the tape? Is the "simple machine" doing the computation, or is it really just consuming pre-digested mush? *What is the true complexity of the total end-to-end computational process?*

From the Busy Beaver perspective, getting an input for free is *cheating*. The blank tape initial condition provides a level playing field by providing nothing whatsoever in advance. Every program has to prepare its own input, and in this way *the total complexity is accurately measured*.

As it happens, *one simple tweak* will suffice to prepare the required input. Simply rearrange the labels so that program execution begins with =COUNT_SECOND_MARK= instead of =POST_AND_FIND=:

#+begin_src c
main() {
 COUNT_SECOND_MARK:
  if (BLANK)
    { PRINT; RIGHT; goto FINALIZE; }
  else
    {/* ... */}

 FINALIZE:
  if (BLANK)
    { PRINT; RIGHT; goto POST_AND_FIND; }
  else
    {/* ... */}

 COUNT_THIRD_MARK:
  // ...

 POST_AND_FIND:
  // ...
}
#+end_src

With this, the first few steps of the program on the blank tape are:

#+begin_src
PRINT;
RIGHT;
goto FINALIZE;
PRINT;
RIGHT;
goto POST_AND_FIND;
#+end_src

*Now there are two marks on the tape and the program is in the initial configuration, ready to rock.* The long computation is executed and a high score is achieved.

* From C to Turing Machine

If you're still reading this, you've probably guessed that the bizarre constraints placed on the C program are based on the *logical structure of Turing machine programs*. When we say that a Turing machine has /n/ "states", this corresponds to a C program with /n/ labels. *"State" is a crappy name, and we should really talk about "labels" instead*. The "colors" or "symbols" of a Turing machine correspond to the numbers that can go into the cells of the tape array.

Renaming the labels of the C program to single letters, we get the code for the champion Turing machine:

#+begin_src
       +-----+-----+
       |  0  |  1  |
   +---+-----+-----+
   | A | 1RB | 1LC |
   +---+-----+-----+
   | B | 1RD | 1RB |
   +---+-----+-----+
   | C | 0RD | 0RC |
   +---+-----+-----+
   | D | 1LD | 1LA |
   +---+-----+-----+
#+end_src

Or, in [[https://nickdrozd.github.io/2020/10/04/turing-machine-notation-and-normal-form.html][string notation]]:

#+begin_src
1RB 1LC  1RD 1RB  0RD 0RC  1LD 1LA
#+end_src

* Structured Programming

We've seen how the champion program works, but the *control flow* is not exactly obvious from the =goto=-ridden code. Clarity can be improved by introducing standard *[[https://nickdrozd.github.io/2021/04/21/structured-programming-for-busy-beavers.html][structured programming]]* operators. For example, consider the =COUNT_THIRD_MARK= label:

#+begin_src c
 COUNT_THIRD_MARK:
  if (BLANK)
    {
      RIGHT;
      goto POST_AND_FIND;
    }
  else
    {
      ERASE;
      RIGHT;
      goto COUNT_THIRD_MARK;
    }
#+end_src

This is equivalent to a =while= loop:

#+begin_src c
  while (!BLANK) {
    ERASE;
    RIGHT;
  }

  RIGHT;
  goto POST_AND_FIND;
#+end_src

Using this and a few other basic transformation techniques, the program can be transformed into *fully well-structured code*:

#+begin_src c
int main(void)
{
  while (1) {
    if (BLANK)
      {
        PRINT;

        do {
          RIGHT;
        } while (!BLANK);

        PRINT;
      }
    else
      {
        LEFT;

        while (!BLANK) {
          ERASE;
          RIGHT;
        }
      }

    RIGHT;

    while (BLANK) {
      PRINT;
      LEFT;
    }

    LEFT;
  }
}
#+end_src

Observe that there are *no =break= or =continue= statements*, and there is *just one branch point*. There is even a =do-while= loop.

* Who wrote this program?

I hope that you are convinced by now that this program is not some kind of inscrutable tangle of spaghetti code. There are *subroutines* that execute particular actions as if in the service of a *plan* of some kind. *It could have been written by somebody.*

And yet, it wasn't. *Nobody wrote it.* It was just floating out there in the full space of 4-state 2-color Turing machine programs, and I managed to find it. *I did not write it.* I woke up one morning and found it on my screen. I didn't have a clue what it did until *[[https://www.sligocki.com/2021/07/17/bb-collatz.html][Shawn Ligocki reverse engineered it]]*. He determined that the program's behavior could be described by the function /L/, and from there I was able to work out the fine details of the program's instructions.

* Turing machine programming exercise

The following exercise is due to *[[https://scottaaronson.blog/?p=5661#comment-1900320][Bruce Smith]]*.

The program described here starts on the blank tape and then the tape is blank again after 32,779,477.

*Add one label to the program so that it reaches the blank tape after 32,810,047 steps.*

Hint: take advantange of the =do-while= loop.

* Footnotes

[fn:1] This initial configuration differs slightly from what some authors refer to as the /standard configuration/. But that "standard" is just a made-up convention, so who cares?
